Revit 2027 API
BuiltInFailures.MEPFabricationFailures.SizeNotAvailableInFabricationService Property
 Sizes:%1!s! in system %2!s! are not available in fabrication service:%3!s!, All available sizes are:\n%4!s!.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SizeNotAvailableInFabricationService { get; }
Public Shared ReadOnly Property SizeNotAvailableInFabricationService As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SizeNotAvailableInFabricationService {
	FailureDefinitionId^ get ();
}
static member SizeNotAvailableInFabricationService : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace